      ******************************************************************
      * copy/GA20.cpy
       01 GA-DISPLAY          PIC X(20) VALUE 'GADISP'.
       01 GA-MULT-RETURN      PIC X(20) VALUE 'GARMULT'.
      *01 GA-MULT-MODIFY      PIC X(20) VALUE 'GAMMULT'.
      ******************************************************************
