      ******************************************************************
      * copy/INTEGERI.cpy
       01 (PRFX)I
         PIC S9(9) USAGE IS COMP-5 VALUE 0.
      ******************************************************************
