      ******************************************************************
      * copy/MV.cpy
       01 (PRFX)MV.
          05 (PRFX)GRADE
            PIC S9(9) USAGE IS COMP-5.
          05 (PRFX)G02.
             10 (PRFX)SC
               COMP-2.
             10 (PRFX)PS
               COMP-2.
          05 (PRFX)G1.
             10 (PRFX)X
               COMP-2.
             10 (PRFX)Y
               COMP-2.
      ******************************************************************
