      ******************************************************************
      * copy/CDISPLAYT.cpy
       01 PRFX-N
         PIC X(20).
      ******************************************************************
