//GA20    JOB
//A EXEC PGM=MULT
//SYSOUT   DD SYSOUT=*
//STEPLIB  DD DSN=PJOOT.GA20V01.LOADLIB,
//  DISP=SHR
//         DD DSN=PJOOT.CMPXLBRY.LOADLIB,
//  DISP=SHR
