      ******************************************************************
      * copy/COMPLEX.cpy
       01  (PRFX)COMPLEX.
         10  (PRFX)RE
           PIC S9(8) COMP-3.
         10  (PRFX)IM
           PIC S9(8) COMP-3.
      ******************************************************************
