      ******************************************************************
      * copy/FLOAT.cpy
       01 (PRFX)V
         PIC S9(8) COMP-3.
      ******************************************************************
