//COMPLEX JOB
//A EXEC PGM=MAIN
//*SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*SYSABEND DD SYSOUT=*
//*SYSTERM  DD SYSOUT=*
//STEPLIB  DD DSN=PJOOT.SAMPLE2.COMPLEX,
//  DISP=SHR
