//COMPLEX JOB
//A EXEC PGM=COMPLEX
//*SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*SYSABEND DD SYSOUT=*
//*SYSTERM  DD SYSOUT=*
//STEPLIB  DD DSN=PJOOT.SAMPLE.COMPLEX,
//  DISP=SHR
