      ******************************************************************
      * copy/CDISPLAY.cpy
       01 (PRFX)N
         PIC X(20).
      ******************************************************************
